Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །ང་ཡི་ཁྱིམ་དུ་མྱུར་དུ་སོང་ལ་ཤིང་སྒྲོག་དང་ནི་ལྕགས་སྒྲོག་ཕྲུགས་སུ་ཆུག་སྟེ་སྒོ་བ་བྱེད་དུ་ཆུག །སྡུག་བསྔལ་ཉེན་ནས་ཀུ་ཅོ་རྣམ་པ་མང་པོ་འདོན་ཅིང་ལྷ་ཡི་ཁོལ་པོ་ཡིན་པར་བདག་གིས་བདག་མཐོང་བྱོས།
en: Take him to my palace, shackle, fetter, and yoke him, and make him my gatekeeper! I will watch him suffer and cry out uncontrollably in many different ways, a slave of the gods.”

source: ནམ་མཁའ་ལ་ནི་རི་མོ་རྣམ་པ་སྣ་ཚོགས་ཆ་ཆ་རིས་རིས་ཕྱེ་སྟེ་སོ་སོར་བྲི་བར་ནུས་ཀྱང་སྲིད།
en: “It is possible that someone can make drawings in the empty sky,

source: །ཕྱོགས་དང་ཕྱོགས་མཚམས་འགྲོ་བའི་ཤུགས་ཅན་རླུང་ནི་མི་ཡིས་རབ་ཏུ་བསྒྲིམས་ཏེ་ཞགས་པས་བཅིང་དུ་ནུས་ཀྱང་སྲིད།
en: Or catch the blowing wind with a lasso,

source: །ཉི་མ་ཟླ་བ་མུན་པ་རབ་རིབ་མེད་བྱེད་མཁའ་ལས་ས་ལ་ལྟུང་བར་བྱེད་པ་ནུས་སྲིད་ཀྱི།
en: Or make the bright sun and moon fall from the sky to the earth,

source: །ཁྱོད་དང་འདྲ་བ་རབ་ཏུ་མང་པོ་བགྲང་ལས་འདས་པ་དག་གིས་ཤིང་དྲུང་ནས་ནི་ང་བསྐྱོད་ནུས་མི་འགྱུར།
en: Yet you, or countless beings like you, will never force me away from this tree.”

source: །བདུད་དཔུང་སྟོབས་དང་ལྡན་པ་ལངས་ཏེ་ཧ་ཞེས་ཟེར།
en: The powerful army of demons came forth.

source: །དུང་དང་རྔ་དང་རྫ་རྔ་མཆོག་གི་སྒྲ་འབྱིན་ལངས།
en: With wild cries, playing conches and various drums, they asked,

source: །བདུད་དཔུང་ཤིན་ཏུ་འཇིགས་པ་འདི་དག་མཐོང་ནས་ནི།
en: “When you see this terrifying army of Māra,

source: །ཀྱི་ཧུད་བུ་སྡུག་ཁྱོད་ཅིས་མ་རུང་གྱུར་ཅེས་ཟེར།
en: Oh, our son, our dear child, are you not annihilated already?

source: །འཛམ་ཀླུང་གསེར་དང་ཙམ་པའི་སྙིང་པོ་འདྲ་བར་སེར།
en: “You are as bright as gold from the Jambū River, or the pericarp of the campaka flower;

source: །ཤིན་ཏུ་གཞོན་ནུ་ལྷ་མིས་བསྟོད་ཅིང་མཆོད་པའི་འོས།
en: You are youthful, praised and honored by gods and humans.

source: །ཁྱོད་དེང་གཡུལ་ངོ་ཆེན་པོར་རབ་ཏུ་བརླག་འགྱུར་ཏེ།
en: But today you will meet your doom in this great battle;

source: །དབང་པོས་ལྷ་མིན་ལྟ་བུར་བདུད་ཀྱི་དབང་དུ་འགྱུར།
en: You will come under the control of Māra, like the moon seized by the demigod.”

source: །ཚངས་པའི་དབྱངས་དང་ཀ་ལ་པིང་ཀའི་སྒྲ་སྐད་ཀྱིས།
en: With the voice of Brahmā and the call of the cuckoo bird,

source: །བདེ་བར་གཤེགས་པས་གནོད་སྦྱིན་སྲིན་ཚོགས་དེ་ལ་སྨྲས། །མི་མཁས་གང་ཞིག་ནམ་མཁའ་སྐྲག་པར་བྱེད་འདོད་པ།
en: The Well-Gone One spoke to the hordes of yakṣas and rākṣasas: “He who hopes to remove someone like me from this perfect tree

source: །དེ་ནི་ཤིང་མཆོག་དྲུང་ནས་ང་འདྲ་སློང་བར་འདོད།
en: Is a fool who tries to frighten space itself.

source: །གང་ཞིག་སྟོང་གསུམ་ཆེན་པོ་བཤིག་ནས་རྡུལ་འགྲང་དང་། །གང་ཞིག་བ་སྤུ་ཡིས་ནི་རྒྱ་མཚོ་ཆུ་འབྱིན་དང་། །སྐད་ཅིག་གིས་ནི་རྡོ་རྗེའི་རང་བཞིན་རི་འཐོར་བ། །དེས་ཀྱང་ཤིང་དྲུང་འདུག་པ་ང་ལ་འཚེ་མི་ནུས།
en: “No one can harm me here beneath this tree, Not even someone who can destroy the trichiliocosm and count its motes of dust, Not even someone who can draw all the water in the oceans through a single straw, Not even someone who can split the supreme diamond mountain in a single instant.”

source: །བདུད་ཁྲོས་སེམས་ཀྱིས་གཉའ་ཤིང་གང་གིས་བར་ཙམ་འདུག །ཤུབས་ནས་ཕྱུང་བའི་རལ་གྲི་རྣོན་པོ་ལག་ན་ཐོགས།
en: Māra, being thus restrained, became angry; He held aloft his unsheathed, sharp sword.

source: །དགེ་སྦྱོང་མྱུར་ལོངས་ང་ཡིས་བསམ་པ་བཞིན་དུ་སོང་།
en: “Monk, quick, get up and do as I tell you,

source: །འོད་མའི་མྱུ་གུ་སྔོ་ལྟར་དོ་མོད་བཅད་ད་རེ།
en: Or I will cut you right away like a bamboo twig or dūrvā grass.”

source: གལ་ཏེ་སྟོང་གསུམ་ས་རྣམས་འདི་དག་ཐམས་ཅད་བདུད་ཀྱིས་རབ་ཏུ་གང་གྱུར་ལ།
en: “Even if this trichiliocosm were filled with demons,

source: །ཀུན་གྱི་ལག་ན་རི་བོ་ལྷུན་པོ་མཆོག་འདྲ་བ་ཡི་རལ་གྲི་ཐོགས་གྱུར་ཀྱང་།
en: And each of them brandished a sword as large as Mount Meru,

source: །དེ་དག་ང་ཡི་བ་སྤུ་བསྐྱོད་པར་མི་ནུས་ང་ལ་གནོད་བྱེད་སྨོས་ཅི་དགོས།
en: They could not bend a hair on my body, let alone kill me. Do not disbelieve me;

source: །སུན་འབྱིན་མ་རིངས་ཤིག་དང་དེའུ་རེ་བཏགས་ཏེ་ང་ཡིས་བརྟན་པོར་དྲན་པར་བྱ།
en: I am reminding you of my firm resolve.”

source: །རྔ་མོ་བ་ལང་གླང་ཆེན་མགོ་དང་འཇིགས་མིག་དང་། །མྱུར་གདུག་སྦྲུལ་དང་མིག་གདུག་མི་བཟད་འདྲ་བ་དག །མེ་འབར་ཁ་དོག་རྩེ་མོར་བཅས་པའི་རི་འཕེན་ཅིང་།
en: With faces of camels, oxen, and elephants, and terrifying eyes, With venomous snakes for arms, with horrible poisonous eyes, They hurled erupting volcanoes at him,

source: །རྩ་བར་བཅས་པའི་ཤིང་དང་ཟངས་དང་ལྕགས་རྣམས་འཕེན།
en: As well as trees with their roots, and copper and iron.

source: །སྤྲིན་ལྟར་ལངས་ཏེ་ཕྱོགས་བཞི་དག་ཏུ་སྒྲ་སྒྲོག་ཅིང་།
en: They gathered like clouds from the four directions,

source: །རྡོ་རྗེའི་ལྕེ་དང་ལྕགས་ཀྱི་ཐུ་ལུམ་ཆར་པ་འབེབས།
en: Roaring and raining down bolts of lightning, iron balls,

source: །རལ་གྲི་མདུང་ཐུང་རྣོ་དང་དགྲ་སྟ་དུག་ཅན་འབེབས།
en: Swords, spears, sharp axes, and poisoned arrows.

source: །ས་ནི་རྟོལ་བར་བྱེད་ཅིང་ཤིང་དག་རབ་ཏུ་འཇོམས།
en: They shattered the earth’s surface and pulverized trees.

source: །ཁ་ཅིག་ལག་པ་བརྒྱ་དག་གིས་ནི་མདའ་བརྒྱ་འཕེན།
en: Some had one hundred hands and shot one hundred arrows.

source: །ཁ་ནས་མྱུར་དུ་གདུག་པའི་སྦྲུལ་དང་མེ་ཡང་འཐོར།
en: From their mouths they shot out poisonous snakes and fire,

source: །ཆུ་སྐྱེས་ཆུ་སྲིན་ལ་སོགས་པ་དག་མཚོ་ནས་ལེན།
en: While seizing crocodiles and other aquatic creatures from the ocean.

source: །ཁ་ཅིག་ནམ་མཁའ་ལྡིང་དུ་བསྒྱུར་ནས་ཀླུ་ཡང་འཕེན།
en: Some transformed into garuḍas and pounced at snakes.

source: །ཁ་ཅིག་ཁྲོས་ནས་ལྕགས་ཀྱི་ཐུ་ལུམ་རི་རབ་ཙམ།
en: Infuriated, some hurled iron balls the size of Mount Meru,

source: །མེ་འབར་ཁ་དོག་རྩེ་མོར་བཅས་པ་རྣམས་ཀྱང་འཕེན།
en: As well as blazing mountain peaks.

source: །ས་ལ་ལྷགས་ནས་ས་ནི་རབ་ཏུ་འཁྲུགས་པར་བྱེད།
en: Hitting the ground, they made the earth quake

source: །འོག་གི་ཆུ་ཡི་ཕུང་པོའི་ཆུ་ཡང་རྣམ་པར་འཁྲུག །ཁ་ཅིག་དེ་ཡི་མདུན་དང་དེ་བཞིན་རྒྱབ་ཏུ་མཆོང་།
en: And stirred up the underground masses of water. Some jumped in front of him and some attacked him from behind;

source: །ཀྱེ་མ་བུ་ཞེས་གཡས་དང་དེ་བཞིན་གཡོན་དུ་མཆོང་།
en: Yelling out, “You child!” they attacked from the left and from the right.

source: །རྐང་པ་ལག་པ་ལོག་པར་འདུག་ཅིང་མགོ་འབར་ལ།
en: Their hands and feet were turned the wrong way, and their heads were afire;

source: །གློག་ལྟར་རབ་ཏུ་འབར་བར་མིག་ནས་མངོན་དུ་འབྱིན།
en: Blazing lightning bolts sprang forth from their eyes.

source: །བདུད་ཀྱི་དཔུང་ནི་བསྒྱུར་བ་མི་སྡུག་བྱས་མཐོང་ནས།
en: As he witnessed this army of demons, ugly with unnatural forms,

source: །སེམས་ཅན་དག་པ་སྒྱུ་མ་བྱས་པ་ཇི་བཞིན་རྟོག །འདི་ལ་བདུད་མེད་སྟོབས་མེད་འགྲོ་མེད་བདག་ཀྱང་མེད།
en: This pure being understood that they were like an illusion. “There is no Māra here, no army, no being, and also no self;

source: །ཆུ་ཟླའི་ཚུལ་འདྲ་བ་ཡི་འཇིག་རྟེན་གསུམ་པོ་འཁོར།
en: Like the moon reflected in a pond, so does this threefold universe revolve.

source: །མིག་དང་སྐྱེས་པ་བུད་མེད་མེད་ཅིང་བདག་གི་མེད།
en: “There is no eye, no man, no woman, and no self;

source: །རྣ་བ་སྣ་དང་དེ་བཞིན་ལྕེ་དང་དེ་བཞིན་ལུས།
en: There is no ear, no nose, no tongue, and no body.

source: །ཆོས་འདི་བྱེད་པ་པོ་དང་ཚོར་བ་པོ་དང་བྲལ།
en: No one created these phenomena and no one experiences them;

source: །བརྟེན་ནས་སྐྱེས་ཏེ་ནང་ཡང་སྟོང་ཞིང་ཕྱི་ཡང་སྟོང་།
en: They arise in dependency and are empty both from within and without.”

source: །བདེན་ཚིག་གང་གིས་འདིར་ཆོས་ཤིན་ཏུ་སྟོང་ཞེ་ན།
en: As he proclaimed the truth that phenomena are empty,

source: །འདུལ་འཐུན་གནོད་སྦྱིན་དེས་པ་གང་ཡིན་དེ་དག་གིས།
en: The yakṣas who are agreeable to discipline

source: །ལག་པའི་མཚོན་ཆ་མེ་ཏོག་ཕྲེང་བར་མཐོང་གྱུར་ཅེས།
en: Perceived the weapons in their hands to be flower garlands.

source: །རྟག་ཏུ་བདེན་སྨྲས་དེ་ཡིས་བདེན་པའི་ཚིག་བྱས་ཏེ།
en: Such was the result of the words spoken by the One Who Always Speaks the Truth.

source: །དེ་ཡིས་ལག་མཐིལ་གཡོན་པ་དྲ་བ་མཆོག་སྤྲས་པ།
en: He gracefully ran his right hand over his body from head to toe— The hand, which was adorned with a fine web,

source: །སེན་མོ་ཟངས་མདོག་རབ་མཛེས་རྩིབས་སྟོང་འཁོར་ལོ་ཅན། །འཛམ་ཀླུང་གསེར་འབར་དང་འདྲ་བསོད་ནམས་དགེས་བསྟེན་པས། །ཚུལ་དུ་ཤིས་པར་མགོ་ནས་རྐང་པའི་བར་དུ་བྱུགས།
en: Which had beautiful copper-colored nails, sparkling like gold from the Jambū River, And was marked with a thousand-spoked wheel, and was auspicious with the merit of virtue.

source: །མཁའ་ལས་གློག་འདྲ་བར་ནི་ལག་པ་བརྐྱང་བྱས་ནས།
en: He stretched out his hand, like a lightning bolt striking from the sky,

source: །ཚིག་ཏུ་སྨྲས་པས་འདི་ང་ཡི་དཔང་ཡིན་ཏེ།
en: And said, “This earth is my witness.

source: །ངས་ནི་སྔོན་ཆད་མཆོད་སྦྱིན་ཁྲག་ཁྲིག་སྣ་ཚོགས་བྱས།
en: In the past I have made millions of elaborate sacrifices

source: །སློང་ལ་མི་སྦྱིན་སྙམ་སྟེ་དོན་མེད་གཞར་མ་བྱིན།
en: And never denied those who petitioned me.

source: །ཆུ་དང་མེ་དང་རླུང་ནི་ང་ཡི་དབང་ཡིན་ཏེ། །ཚངས་པ་སྐྱེ་དགུ་བདག་དང་སྐར་བཅས་ཉི་ཟླ་དང་། །གང་དག་ཕྱོགས་བཅུ་དག་ན་བཞུགས་པའི་སངས་རྒྱས་དང་། །བདག་ཁྲིམས་བརྟུལ་ཞུགས་བྱང་ཆུབ་ཡན་ལག་འཕགས་པ་དཔང་།
en: “Water and fire and wind are my witnesses, And so are Brahmā, the lord of beings, the moon, the sun, and the stars. The buddhas in the ten directions are my witnesses; My discipline, practice, and the superior branches of awakening are all my witnesses.

source: །སྦྱིན་དང་ཚུལ་ཁྲིམས་དེ་བཞིན་བཟོད་པ་ང་ཡི་དཔང་།
en: “Generosity, discipline, and patience are my witnesses;

source: །བརྩོན་འགྲུས་དེ་བཞིན་བསམ་གཏན་དེ་ལྟར་ཤེས་རབ་དང་། །ཚད་མེད་བཞི་དང་དེ་བཞིན་མངོན་ཤེས་ང་ཡི་དཔང་།
en: Diligence, concentration, and knowledge, The four limitless contemplations, and the five higher knowledges are my witnesses.

source: །རིམ་གྱིས་བྱང་ཆུབ་སྤྱོད་པ་ཐམས་ཅད་ང་ཡི་དཔང་།
en: In fact all the gradual practices of awakening are my witnesses.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་སེམས་ཅན་མཐའ་དག་ཇི་སྙེད་པ།
en: “However many beings there are in the ten directions,

source: །དེ་དག་རྣམས་ཀྱི་བསོད་ནམས་ཚུལ་ཁྲིམས་ཡེ་ཤེས་དང་། །གཏན་པ་མེད་པའི་མཆོད་སྦྱིན་བྱས་པ་བསྡོམས་ཀྱང་ནི།
en: With all their strength of merit, discipline, and wisdom, And all their many unrestricted sacrifices,

source: །དེ་དག་ང་ཡི་བ་སྤུའི་བརྒྱ་ཡི་ཆར་མི་ཕོད།
en: They do not equal even a hundredth of the qualities in a single hair of mine.”

source: །དེ་ཡིས་ཚུལ་དུ་ཤིས་པར་ལག་པ་ས་ལ་བརྡབས།
en: He gracefully touched his hand to the earth

source: །ཁར་བའི་སྣོད་ལྟར་ས་འདི་སྒྲ་ཡང་བྱུང་བར་གྱུར།
en: So that the earth resounded like a copper vase.

source: །བདུད་ཀྱི་སྒྲ་ཐོས་ནས་ནི་ས་ལ་སྒྱེལ་གྱུར་ཏེ།
en: As Māra heard this, he fell to the ground, And then heard the words, “Strike!

source: །ནག་པོའི་རྩ་ལག་རྒྱོབ་ཤིག་ཟུང་ཤིག་སྒྲ་ཡང་ཐོས།
en: Catch this friend of darkness.”

source: །ལུས་ལས་རྔུལ་བྱུང་གཟི་བརྗིད་ཉམས་ཤིང་བཞིན་མདོག་གྱུར།
en: As Māra’s body started to sweat, his splendor disappeared and his face grew pale;

source: །རྒ་བས་བཅོམ་པར་བདུད་དེ་ཉིད་ཀྱིས་མཐོང་བར་གྱུར།
en: Māra now saw himself overcome by old age.

source: །བྲང་རྡུང་ཆོ་ངེ་འདོན་ཅིང་འཇིགས་ཉེན་མགོན་ཡང་མེད།
en: He beat his chest and cried out in fear, with no protector in sight;

source: །བདུད་ཀྱི་ཡིད་འཁྲུལ་གྱུར་ཅིང་སེམས་ནི་མྱོས་པར་གྱུར།
en: Māra’s mind was confused and his thoughts befuddled.

source: །གླང་པོ་རྟ་དང་བཞོན་པ་ཤིང་རྟ་ས་ལ་ལྷུང་།
en: His elephants, horses, conveyances, and chariots all fell to the ground;

source: །སྲིན་པོ་གྲུལ་བུམ་དག་དང་ཤ་ཟ་སྔངས་ཤིང་རྒྱུག །མགོ་རྨོངས་ལམ་མི་རྙེད་ཅིང་གནས་མེད་སྐྱབས་ཀྱང་མེད།
en: The yakṣas, kumbhāṇḍas, and flesh eaters were terrified and ran. Disoriented, they could not find their way, and without resting place or protection,

source: །རླུང་བཏབ་ནགས་མེས་བྱས་ལྟར་བལྟས་ནས་སོང་བར་གྱུར།
en: They fled like birds seeing a forest fire.

source: །ཕ་མ་བུ་དང་སྲིང་མོ་དེ་བཞིན་ཕུ་ནུ་དག །གང་ན་མཐོང་ཞིང་གང་དུ་དོང་ཞེས་འདྲི་བར་བྱེད།
en: Parents, children, sisters, and brothers asked about them: “Where were they seen? Where have they gone?”

source: །དེ་ཡི་རྐྱེན་གྱིས་དེ་དག་ཕན་ཚུན་འཐབ་ཅིང་རྩོད།
en: And in this way they started to argue and fight with each other:

source: །བདག་ནི་སྡུག་བསྔལ་གྱུར་ཏེ་འཚོ་བའི་སྐབས་ཀྱང་མེད།
en: “Such suffering has befallen us, and there are no prospects for living.”

source: །བདུད་དཔུང་རྒྱ་ཆེ་མང་བ་མི་འཁྲུགས་སྙེད་པོ་དེ།
en: The great army of demons, so utterly unshakable,

source: །ཐམས་ཅད་རྣམ་པར་འཐོར་ཅིང་ཐ་དགུར་གྱེས་གྱུར་ཏེ།
en: Was now all gone, dispersed, and no more together.

source: །ཞག་བདུན་འདས་ཀྱི་བར་དུ་ཕན་ཚུན་ཕྲད་མ་གྱུར།
en: For seven days they did not see each other,

source: །མཐོང་ནས་སྨྲས་པ་གལ་ཏེ་གསོན་ན་དགའ་ཞེས་འཛེར།
en: And when they finally did see their phantasmal forms, they said, “Great to see you alive.”

source: །ཤིང་གི་ལྷ་མོས་དེ་ཚེ་དེ་ལ་སྙིང་རྗེ་བྱས།
en: The goddess in the tree felt compassion;

source: །ཆུ་ཡི་བུམ་པ་ཐོགས་ཏེ་ནག་པོའི་རྩ་ལག་གཏོར།
en: She took her vase with water and sprinkled the friend of darkness.

source: །མྱུར་དུ་ལོངས་ལ་ཕྱི་ཤོལ་མ་བྱེད་སྐྱེན་དུ་སོང་།
en: “Quick, get up! You must depart without delay!

source: །བླ་མའི་ཚིག་མ་མཉན་པས་དེ་ལྟར་གྱུར་པ་ཡིན།
en: For this is what happens to those who pay no heed to the words of the Master.”

source: བདག་གི་བུ་ཡི་སྙན་ཚིག་ཕན་པ་མ་མཉན་ཏེ།
en: “I did not listen to the kind and helpful advice of my sons,

source: །སེམས་ཅན་ཤིན་ཏུ་དག་ལ་ཉེས་པ་བྱས་པས་ན།
en: And offended against a perfectly pure being.

source: །སྡུག་བསྔལ་འཇིགས་ཕོངས་མྱ་ངན་བརླག་དང་བརྙས་པ་དང་། །ཅིར་མི་རུང་བའི་སྒྲ་དང་དམན་ཉིད་བདག་གིས་ཐོབ།
en: Therefore I now reap suffering, fear, misfortune, grief, ruin, Lamentation, loss of honor, and this miserable state.”

source: མི་མཁས་གང་ཞིག་ཉེས་པ་མེད་ལ་ཉེས་བྱེད་པ།
en: “A fool who offends against those who are faultless

source: །དེ་ནི་ཉེས་དང་སྡུག་བསྔལ་བ་དང་ཕོངས་པ་དང་། །ཅིར་མི་རུང་ཞེས་བྱ་བའི་སྒྲ་དང་དམན་ཉིད་དང་། །གསད་དང་བཅིང་དང་ཉེས་པ་དུ་མ་རྙེད་པར་འགྱུར།
en: Shall himself meet with many troubles— Fear, suffering, calamities, misery, Lamentation, murder, and bondage.”

source: །ལྷ་དང་ལྷ་མིན་མཁའ་ལྡིང་མི་ཅི་སྲིན་པོའི་དབང་།
en: The leaders of gods, demigods, garuḍas, kinnaras, and rākṣasas,

source: །ཚངས་པ་བརྒྱ་བྱིན་གཞན་འཕྲུལ་འོག་མིན་བཅས་པ་དག །འདི་ལྟར་ཁྱོད་ཀྱིས་འདི་འདྲའི་བདུད་ཀྱི་དཔུང་བཅོམ་པས།
en: Brahmā, Indra, and the gods in the Heaven of Making Use of Others’ Emanations And the Heaven of Joy all proclaimed his victory and called out, “You have conquered Māra’s army!

source: །འཇིག་རྟེན་དཔའ་བོ་རྒྱལ་ཞེས་དེ་ཡིས་རྒྱལ་བ་བརྗོད།
en: Hero of the World, be victorious!”

source: རྒྱན་ཕྲེང་ཆུན་པོ་ཟླ་བ་གདུགས་དང་རྒྱལ་མཚན་བ་དན་འབུལ།
en: They offered garlands of pearls, crescent moons, parasols, flags, and banners,

source: །མེ་ཏོག་ཨ་ག་རུ་དང་རྒྱ་སྤོས་ཙན་དན་ཕྱེ་ཆར་འབེབས།
en: And showered him with flowers and powders of aloe, tagara, and sandalwood.

source: །སིལ་སྙན་དག་ཀྱང་རབ་ཏུ་དཀྲོལ་བ་བྱེད་ཅིང་ཚིག་བརྗོད་པ།
en: They played music and sang,

source: །དཔའ་བོ་དགྲ་ཚོགས་རྒྱལ་རྣམས་ཁྱོད་ལ་དགབ་པ་མཛད་པར་འགྱུར།
en: “Sit at the tree, O Hero, O Lion Who Conquers His Enemies.

source: །སྟན་མཆོག་འདིར་ནི་བྱམས་པས་གཡོན་ཅན་བདུད་ཀྱི་ཕྱོགས།
en: “At this supreme seat, you have conquered with love the wicked army of demons.

source: །རྒྱ་ཆེན་ཕམ་མཛད་དཔའ་བོ་དོ་མོད་བྱང་ཆུབ་བརྙེས།
en: Hero, today you shall attain awakening!

source: །སྟོབས་བཅུ་མ་འདྲེས་སོ་སོ་ཡང་དག་རིག་པ་དང་། །སངས་རྒྱས་ཡུལ་རྣམས་ཐམས་ཅད་དོ་མོད་བརྙེས་པར་འགྱུར།
en: The ten powers, the unique qualities, the distinct realizations, And the experiences of a buddha you shall attain today.

source: །བདུད་གདུལ་ཆེད་དུ་འདིར་ནི་གཡུལ་ངོར་རབ་ཏུ་ཞུགས།
en: “In order to tame Māra, you entered this battle. There were 360 million beings who witnessed

source: །རྫོགས་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་རྩལ་སུས་མཐོང་བ།
en: The power and might of a perfect bodhisattva,

source: །བྱེ་བ་སུམ་ཅུ་དྲུག་དང་ཁྲག་ཁྲིག་ཉི་ཤུ་བཞི། །དེ་དག་སངས་རྒྱས་བྱང་ཆུབ་མཆོག་ཏུ་ཡིད་ཀྱིས་སྨོན།
en: And 240 million who formed the wish for the perfect awakening of a buddha!”

source: །བདུད་བཏུལ་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། ཉི་ཤུ་རྩ་གཅིག་པའོ།། །།
en: This concludes the twenty-first chapter, on conquering Māra.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ། དགྲ་བཏུལ་བ། གཡུལ་ངོར་གཡུལ་ལས་རྣམ་པར་རྒྱལ་བ། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བས་འདོད་པ་རྣམས་ལས་དབེན་པ།
en: Monks, once the Bodhisattva had destroyed his demonic opponents, vanquished his enemies, triumphed in the face of battle, and raised high the parasols, standards, and banners of conquest, he settled into the first meditative concentration.

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: That state is free from desires, free of factors connected with evil deeds and nonvirtues, accompanied by thought and analysis, and imbued with the joy and pleasure born of discernment.

source: སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: Through this he settled into the second meditative concentration, which is free of thought and analysis and is imbued with the joy and pleasure born of meditative absorption.

source: །དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་། དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: Through disenchantment with joy, he remained impartial, maintained mindfulness and introspection, and experienced physical pleasure.

source: འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ། དགའ་བ་མེད་པ་བསམ་གཏན་གསུམ་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ།
en: He thus settled into the third meditative concentration, which is unconnected with joy. The noble ones call such a person the impartial one dwelling on pleasure that is imbued with mindfulness.

source: །དེ་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་བ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན།
en: Through relinquishing pleasure at that moment, and having formerly relinquished pain in the past, both mental pleasure and displeasure vanished.

source: སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་རྫོགས་པར་བྱས་ཏེ་གནས་སོ། །
en: Thus he settled into the fourth meditative concentration, which is perfectly pristine impartiality and mindfulness, unconnected with pleasure or pain.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུར་སྙོམས་པར་ཞུགས་པའི་སེམས་ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། འོད་གསལ་བ། ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། མཉེན་པ། ལས་སུ་རུང་བར་གནས་པ། མི་གཡོ་བར་གྱུར་པས་ནམ་གྱི་ཆ་སྟོད་ལ་ལྷའི་མིག་ལས་ཡེ་ཤེས་མཐོང་བའི་རིག་པ་མངོན་དུ་བྱ་བའི་ཕྱིར་སེམས་མངོན་པར་སྒྲུབ་ཅིང་མངོན་པར་གཏོད་དོ།
en: While the Bodhisattva’s mind—purified and cleansed, lucid, free of basic and subsidiary afflictions, gentle, adaptable, and immovable—was immersed in this way, in the early station of the night he produced the intent to actualize the knowledge that sees wisdom with the divine eye, and so he directed his mind toward that purpose.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལྷའི་མིག་ཡོངས་སུ་དག་པ་མིའི་ལས་ཤིན་ཏུ་འདས་པས་སེམས་ཅན་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་དང་། བཟང་པོ་དང་། ངན་པ་རྣམས་མཐོང་ངོ་། །ལས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བའི་སེམས་ཅན་རྣམས་ཀྱང་རབ་ཏུ་ཤེས་ཏེ།
en: The Bodhisattva, with the pristine divine eye beyond that of humans, looked at sentient beings. He saw them dying and being born, in all their beauty and ugliness, in favorable and unfavorable circumstances, degenerating or advancing precisely in accordance with their actions. With this understanding he thought:

source: ཀྱེ་མ་སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ཉེས་པར་སྤྱད་པ་དང་ལྡན་པ། ངག་དང་ཡིད་ཀྱིས་ཉེས་པར་སྤྱད་པ་དང་ལྡན་པ།
en: “Alas! Sentient beings engage in negative physical, verbal, and mental conduct.

source: འཕགས་པ་རྣམས་ལ་སྐུར་པ་འདེབས་པ། ལོག་པར་ལྟ་བ་དག་སྟེ།
en: Harboring wrong views, they revile the noble ones.

source: དེ་དག་ལོག་པར་ལྟ་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་སྟེ་ཤི་བའི་འོག་ཏུ་ངན་སོང་ངན་འགྲོ་ལོག་པར་ལྟུང་བ་སེམས་ཅན་དམྱལ་བ་རྣམས་སུ་སྐྱེ་བར་འགྱུར་བ་དག་གོ། །སེམས་ཅན་འདི་དག་ནི་ལུས་ཀྱིས་ལེགས་པར་སྤྱད་པ་དང་ལྡན་པ།
en: As they engage in the actions associated with wrong views, once their bodies collapse and they die, they fall into bad migrations and are born among the hell realms.

source: ངག་དང་ཡིད་ཀྱིས་ལེགས་པར་སྤྱད་པ་དང་ལྡན་པ།
en: Yet other sentient beings engage in positive physical, verbal, and mental conduct.

source: འཕགས་པ་རྣམས་ལ་སྐུར་པ་མི་འདེབས་པ། ཡང་དག་པར་ལྟ་བ་དག་སྟེ།
en: Harboring the correct view, they do not revile noble ones.

source: དེ་དག་ཡང་དག་པར་ལྟ་བའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུས་ལུས་ཞིག་ནས་བདེ་འགྲོ་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་ལྷའི་ནང་དུ་སྐྱེ་བར་འགྱུར་བ་དག་གོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: Since they engage in the actions associated with the correct view, once their bodies collapse and they die, they are born into pleasant existences in the god realms.”

source: །དེ་ལྟར་ལྷའི་མིག་རྣམ་པར་དག་པ་མིའི་ལས་ཤིན་ཏུ་འདས་པས་སེམས་ཅན་འཆི་འཕོ་བ་དང་། སྐྱེ་བ་དང་། ཁ་དོག་བཟང་པོ་དང་། ཁ་དོག་ངན་པ་དང་། བདེ་འགྲོར་སོང་བ་དང་། ངན་འགྲོར་སོང་བ་དང་། ངན་པ་དང་། བཟང་པོ་དག་དང་། ལས་ཇི་ལྟ་བ་བཞིན་དུ་འགྲོ་བ་རྣམས་མཐོང་ངོ་།
en: In this manner, with his pristine divine eye beyond that of humans, the Bodhisattva saw sentient beings dying and being born, in all their beauty and ugliness, in favorable and unfavorable circumstances, degenerating and advancing, respectively, precisely in accordance with their actions.

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ནམ་གྱི་ཆ་སྟོད་ལ་རིག་པ་མངོན་སུམ་དུ་བྱེད་དོ། །མུན་པ་སེལ་ཏོ། །སྣང་བ་བསྐྱེད་དོ། །
en: Monks, this was indeed how, during the first station of the night, the Bodhisattva actualized knowledge, removed darkness, and lit the light.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལྟ་བུར་སྙོམས་པར་ཞུགས་པའི་སེམས་ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ། འོད་གསལ་བ།
en: Then, while his mind—purified and cleansed, lucid, free of basic and subsidiary afflictions, supple, flexible, and immovable—was immersed in this way, in the middle station of the night the Bodhisattva produced the intent to actualize the knowledge that sees the wisdom of recollecting past lives, and so he directed his mind toward that purpose.

source: ཉོན་མོངས་པ་མེད་པ། ཉེ་བའི་ཉོན་མོངས་པ་དང་བྲལ་བ། མཉེན་པ། ལས་སུ་རུང་བར་གནས་པ། མི་གཡོ་བར་གྱུར་པས་ནམ་གྱི་གུང་ཐུན་ལ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཡེ་ཤེས་མཐོང་བའི་རིག་པ་མངོན་དུ་བྱ་བའི་ཕྱིར་སེམས་མངོན་པར་སྒྲུབ་ཅིང་མངོན་པར་གཏོད་དོ། །དེ་བདག་དང་སེམས་ཅན་གཞན་དག་གི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ། འདི་ལྟ་སྟེ། སྐྱེ་བ་གཅིག་དང་། གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་དང་། ཉི་ཤུ་དང་། སུམ་ཅུ་དང་། བཞི་བཅུ་དང་། སྐྱེ་བ་ལྔ་བཅུ་དང་། སྐྱེ་བ་བརྒྱ་དང་། སྐྱེ་བ་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་བྱེ་བ་དང་། སྐྱེ་བ་བྱེ་བ་ཕྲག་བརྒྱ་དང་། སྐྱེ་བ་བྱེ་བ་ཕྲག་སྟོང་དང་། སྐྱེ་བ་བྱེ་བ་བརྒྱ་སྟོང་དང་། སྐྱེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དང་། སྐྱེ་བ་བྱེ་བ་བརྒྱ་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་བྱེ་བ་སྟོང་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་བྱེ་བ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དང་། སྐྱེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ནས། འཇིག་པའི་བསྐལ་པ་དང་། འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དང་། འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་དུ་མ་དག་ཀྱང་རྗེས་སུ་དྲན་ནོ། །
en: In this way he recollected the previous lives of himself and other sentient beings, starting with one, two, three, four, and five lifetimes, then ten, twenty, thirty, forty, and fifty more lifetimes, then one hundred lifetimes, one thousand lifetimes, one hundred thousand lifetimes, then many hundreds of thousands of lifetimes, ten million lifetimes, a billion lifetimes, ten billion lifetimes, a trillion lifetimes, and a quadrillion lifetimes, then several billion, several tens of billions, several trillions, and several quadrillions of lifetimes, all the way up to the lifetimes in an eon of destruction, an eon of formation, an eon of both destruction and formation, and several eons of both destruction and formation.

source: བདག་ཆེ་གེ་མོ་ཞེས་བྱ་བ་ཞིག་ཏུ་གྱུར་ཏེ། མིང་འདི་ཞེས་བྱ་བར་གྱུར་ཏོ། །རུས་ནི་འདི་ཞེས་བྱའོ། །རིགས་ནི་འདི་ཞེས་བྱའོ། །ཁ་དོག་ནི་འདི་ལྟ་བུའོ། །ཁ་ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟའོ། །ཚེའི་ཚད་ནི་འདི་ཙམ་ཞིག་ཐུབ་བོ། །ཡུན་ནི་འདི་སྲིད་ཅིག་གནས་གནས་སོ། །བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་ངོ་།
en: He remembered the former lives of himself and others in the greatest detail, thinking, “In that place I had this name, this surname, this family, this caste, this diet, this lifespan, stayed for this duration, and experienced these kinds of pleasure and pain.

source: །བདག་དེ་ནས་ཤི་འཕོས་ནས་ཆེ་གེ་མོ་ཞེས་བྱ་བ་ཞིག་ཏུ་སྐྱེས་སོ། ། དེ་ནས་ཤི་འཕོས་ནས་ཀྱང་ཆེ་གེ་མོ་ཞེས་བྱ་བ་ཞིག་ཏུ་སྐྱེས་སོ། །
en: After falling from there, I was born here. After falling from there, I was born here…”
